Revit 2025 API
ParameterTypeId.RebarElemHookStartOrient Property
 "Hook Orientation At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarElemHookStartOrient { get; }
Public Shared ReadOnly Property RebarElemHookStartOrient As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarElemHookStartOrient {
	ForgeTypeId^ get ();
}
static member RebarElemHookStartOrient : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace